App({
  onLaunch: function () {
    //调用API从本地缓存中获取数据
    // var logs = wx.getStorageSync('logs') || []
    // logs.unshift(Date.now())
    // wx.setStorageSync('logs', logs)
    var value = "玫瑰,月季,董永,许仙,若曦,晴川,谢娜,李湘,孟非,乐嘉,牛奶,豆浆,保安,保镖,白菜,生菜,辣椒,芥末,金庸,古龙 ,赵敏,黄蓉,海豚,海狮,水盆,水桶,唇膏,口红,森马,以纯,烤肉,涮肉,气泡,水泡,纸巾,手帕,杭州,苏州,香港,台湾,首尔,东京,橙子,橘子,葡萄,提子,太监,人妖,蝴蝶,蜜蜂,小品,话剧,裸婚,闪婚,新年,跨年,吉他,琵琶,公交,地铁,剩女,御姐,童话,神话,作家,编剧,警察,捕快,结婚,订婚,奖牌,金牌,孟飞,乐嘉,那英,韩红,面包,蛋糕,作文,论文,油条,麻花,壁纸,贴画,枕头,抱枕, 手机,座机,同学,同桌,婚纱,喜服,老佛爷,老天爷,魔术师,魔法师,鸭舌帽,遮阳帽,双胞胎,龙凤胎,情人节,光棍节,丑小鸭,灰姑娘,富二代,高富帅,生活费,零花钱,麦克风,扩音器,郭德纲,周立波,图书馆,图书店,男朋友,前男友,洗衣粉,皂角粉,牛肉干,猪肉脯,泡泡糖,棒棒糖,小沈阳,宋小宝,土豆粉,酸辣粉,蜘蛛侠,蝙蝠侠,口香糖,木糖醇,酸菜鱼,水煮鱼,小笼包,灌汤包,薰衣草,满天星,张韶涵,王心凌,刘诗诗,刘亦菲,甄嬛传,红楼梦,甄子丹,李连杰,包青天,狄仁杰,大白兔,金丝猴,果粒橙,鲜橙多,沐浴露,沐浴盐,洗发露,护发素,自行车,电动车,班主任,辅导员,过山车,碰碰车,铁观音,碧螺春,十面埋伏,四面楚歌,成吉思汗,努尔哈赤,谢娜张杰,邓超孙俪,福尔摩斯,工藤新一,贵妃醉酒,黛玉葬花,流星花园,花样男子,神雕侠侣,天龙八部,天天向上,非诚勿扰,勇往直前,全力以赴,鱼香肉丝,四喜丸子,麻婆豆腐,皮蛋豆腐,语无伦次,词不达意"
    try {
      wx.setStorageSync("1", value)
    } catch (e) {
      console.log("数据同步存储异常:" + e)
    }
  },
  globalData: {
    userInfo: null,
    awardsConfig: {},
    runDegs: 0,
    judge_dragon:false,
    judge_phoenix:false,
    words_library: ['西瓜', '守株待兔', '高富帅', '袋鼠', '普京', '臭氧', '蹲起', '皇家', '马德里', '菊花', '金鸡独立', '机器猫', '熊猫', '周杰伦', '地震', '跳舞', '牙膏', '龟兔赛跑', '微信', '猩猩', '王菲', '积雨云', '跆拳道', '圆明园', '身份证', '非诚勿扰', '孙悟空', '猪', '周星驰', '瑜伽', '莫高窟', '苹果', '眉来眼去', '法拉利', '兔子', '孙俪', '切断', '低压', '打嗝', '钓鱼岛', '橙子', '回眸一笑', '甄嬛', '企鹅', '邓超', '阻塞', '高压', '倒立', '兵马俑', '榴莲', '鸡飞狗跳', '雾霾', '狮子', '范冰冰', '沃克', '环流', '我爱你', '南海', '火锅', '狼吞虎咽', '葫芦娃', '老虎', '小沈阳', '卫星', '云图', '游泳', '青岛', '口香糖', '花枝招展', '哏儿', '乌龟', '郭德纲', '多普勒', '雷达', '俯卧撑', '香港', '脑白金', '抓耳挠腮', '忐忑', ' 狐狸', '刘德华', '东北', '牙疼', '闵', '奔驰', '手舞足蹈', '喜羊羊', '蜗牛', '彭丽媛', '海风', '面条', '金针菇', '含情脉脉', '母老虎', '张无忌', '睡觉', '百合', '火箭队', '郎平', '升国旗', '伦敦', '芦荟', '五体投地', '海豚', '秦始皇', '冰雹', '骑马', '雅安', '夏天', '坐井观天', '愤怒的小鸟', '鸳鸯', '奥巴马', '龙卷风', '打篮球', '团泊湖', '鸡蛋灌饼', '亡羊补牢', '处女座', '草履虫', '姚明', '彩虹', '羽毛球', '春卷', '对牛弹琴', '红楼梦', '和平鸽', '赵丽蓉', '太阳', '辐射', '求婚', '黄山', '奶糖', '画蛇添足', '白雪公主', '海星', '五月天', '跑步', '厦门', '豆腐脑', '龙飞凤舞', '蜜蜂', '合肥', '地铁', '飞蛾扑火', '鲍鱼', '霍金', '绝热', '二人转', '桂林']
  },
  onShareAppMessage: function () {
    // 用户点击右上角分享
    return {
      title: '谁是卧底', // 分享标题
      desc: '让你的聚会更加精彩', // 分享描述
      path: 'path' // 分享路径
    }
  }
})